backend/controllers/GroupPermissionController.php

SELECT * FROM `auth_item_child` WHERE `parent`='author'
---
    public function actionIndex()
    {
		if(!empty($_POST['permission'])){
			echo '<pre>';
			print_r($_POST);

			$mainChild = array();
			$mainChild = $_POST['permission_child'];
			$mainChildarray = array();
			if($mainChild){
				$i = 0;
				foreach($mainChild as $key=>$value){
						$mainChildarray[$i]['parent'] = $_POST['permission'];
						$mainChildarray[$i]['child'] = $value;
						$i++;
				}
			}
			$queryData2 = AuthItemChild::find()->where(['parent'=>$_POST['permission_child']])->asArray()->all();

DELETE FROM `auth_item_child` WHERE parent = 'admin'
INSERT INTO `auth_item_child` (`parent`, `child`) VALUES ('admin', 'author')
INSERT INTO `auth_item_child` (`parent`, `child`) VALUES ('admin', 'backend:Rbac:Init'), ('admin', 'backend:Setting:Edit'), ('admin', 'backend:Setting:Index')
SELECT * FROM `auth_item` WHERE (`type`=2) AND (name like 'common%' or name like 'frontend%' or name like 'backend%')
SELECT * FROM `auth_item` WHERE `type`=1
---
					}
				}
			}
			AuthItemChild::deleteAll('parent = :parent', [':parent' => $_POST['permission']]);
			Yii::$app->db->createCommand()->batchInsert('auth_item_child', ['parent', 'child'], $mainChildarray)->execute();
			Yii::$app->db->createCommand()->batchInsert('auth_item_child', ['parent', 'child'], $mainChildAction)->execute();
			$this->redirect(Url::to(['group-permission/index']));
		}
		$AuthItemAction = AuthItem::find()->where(['type' => 2])->andWhere('name like :name or name like :name1 or name like :name2',[':name'=>"common%", ':name1'=>"frontend%", ':name2'=>"backend%"])->asArray()->all();
		$AuthItemRole = AuthItem::find()->where(['type' => 1])->asArray()->all();

SELECT * FROM `auth_item` WHERE (`type`=1) AND ('admin' != :'admin')
SELECT * FROM `auth_item_child` WHERE `parent`='admin'
---
	public function actionGetChildRole(){
		$this->layout = false;
		if(Yii::$app->request->isAjax){
            $queryData = AuthItem::find()->where(['type' => 1])->andWhere('name != :name', ['name'=>$_POST['id']])->asArray()->all();
			$queryData1 = AuthItemChild::find()->where(['parent' => $_POST['id']])->asArray()->all();

SELECT * FROM `auth_item` WHERE (`type`=2) AND (name like 'common%' or name like 'frontend%' or name like 'backend%')
SELECT * FROM `auth_item` WHERE (`type`=1) AND ('admin' != :'admin')
SELECT * FROM `auth_item_child` WHERE `parent`='admin'
SELECT * FROM `auth_item_child` WHERE `parent` IN ('author', 'seller')
---
	public function actionGetRolePermission(){
		$this->layout = false;
		if(Yii::$app->request->isAjax){
            $AuthItemAction = AuthItem::find()->where(['type' => 2])->andWhere('name like :name or name like :name1 or name like :name2',[':name'=>"common%", ':name1'=>"frontend%", ':name2'=>"backend%"])->asArray()->all();
			$queryData = AuthItem::find()->where(['type' => 1])->andWhere('name != :name', ['name'=>$_POST['id']])->asArray()->all();
			$queryData1 = AuthItemChild::find()->where(['parent' => $_POST['id']])->asArray()->all();
			$roleChild = array();
			$mainChildAction = array();
			$childChildAction = array();
			if($queryData){
				$AuthItemRole = array();
				foreach($queryData as $key=>$value){
					$AuthItemRole[$value['name']] = $value['name'];
				}
				if($queryData1){
					foreach($queryData1 as $key=>$value){
						if(in_array($value['child'], $AuthItemRole)){
							$roleChild[] = $value['child'];
						}else{
							$mainChildAction[] = $value['child'];
						}
					}
				}
			}
			if($roleChild || !empty($_POST['child'])){
				if(!empty($_POST['child'])){
					$roleChild = explode(',', $_POST['child']);
				}
				$queryData2 = AuthItemChild::find()->where(['parent'=>$roleChild])->asArray()->all();