backend/controllers/UserController.php

SELECT COUNT(*) FROM `users`
SELECT * FROM `users` ORDER BY `id` LIMIT 10
---
    public function actionIndex()
    {
        if(!Yii::$app->user->isGuest){
            $users = User::find();
            $pagination = new Pagination(['defaultPageSize'=>DEFAULT_PAGE_SIZE, 'totalCount'=> $users->count()]);
            $users = $users->offset($pagination->offset)->limit($pagination->limit)->orderBy('id')->all();