common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => ACTIVE]);
---
SELECT * FROM `users` WHERE (`id`=96) AND (`status`=1)

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);//'status' => ACTIVE
---
SELECT * FROM `users` WHERE `username`='ankit'